app/Helpers/log_helper.php

INSERT INTO `logs` (`level`, `message`, `user_id`, `created_at`) VALUES ('info', 'Felhasználó ID 1 aktiválva lett.', '1', '2024-10-13 10:58:08')
---
    function log_to_db($level, $message, $userId = null)
    {
        // LogModel példány létrehozása
        $logModel = new LogModel();

        // Log mentése az adatbázisba
        $logModel->insert([
            'level'    => $level,
            'message'  => $message,
            'user_id'  => $userId,
        ]);