app/Controllers/AdminController.php

    public function users()
    {
        $userModel = new UserModel();

        // Összes felhasználó lekérdezése
        $data = [
            'users' => $userModel->findAll(),
            'head_title' => 'Felhasználók',
            'breadcrumb_item' => 'Admin részleg',
        ];
---
SELECT *
FROM `users`