app/Controllers/Auth.php

    public function login()
    {
        helper(['form']);  // Form helper betöltése

        if ($this->request->getMethod() === 'post') {
            $rules = [
                'username' => 'required',
                'password' => 'required',
            ];

            if ($this->validate($rules)) {
                $model = new UserModel();
                $username = $this->request->getPost('username');
                $password = $this->request->getPost('password');

                // Felhasználó lekérdezése a felhasználónév alapján
                $user = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'dio'
 LIMIT 1